lisp/clbe/clbe-21.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-04 Sat 22:54 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Symbols &amp; Variables</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="preamble" class="status">
Love. Peace. Kindness
</div>
<div id="content">
<h1 class="title">Symbols &amp; Variables</h1>
<p>
Previous: <a href="clbe-20.html">20. Packages</a>
</p>

<p>
Next: <a href="clbe-22.html">22. Lambda Expressions</a>
</p>

<p>
A deeper understanding of symbols and variables is useful as you
progress to more advanced Lisp programs and we will aim to cover some
of their detail here.
</p>

<div id="outline-container-orgdc5b18e" class="outline-2">
<h2 id="orgdc5b18e">* Internal Representation of Symbols</h2>
<div class="outline-text-2" id="text-orgdc5b18e">
<p>
Symbols are Lisp data objects that serve several purposes and have
several interesting characteristics. Conceptually, a symbol is a block
of five pointers. Internally, symbols are composed of five cells: the
name, value, function, plist, and package cells. A symbol may have
uppercase letters, lowercase letters, numbers, certain special
characters or a mixture in its print name; it however cannot be a
number.
</p>

<p>
Symbols are unique, meaning there can be only one symbol in the
computer’s memory with a given name. Every object in the memory has a
numbered location, called its address. Since a symbol exists in only
one place in memory, symbols have unique addresses.
</p>

<p>
Every object of type symbol has a name, called its print name: Given a
symbol, one can obtain its name in the form of a string. Conversely,
given the name of a symbol as a string, one can obtain the symbol
itself. (More precisely, symbols are organized into packages, and all
the symbols in a package are uniquely identified by name).
</p>
</div>
</div>

<div id="outline-container-org83fa340" class="outline-2">
<h2 id="org83fa340">Variables &amp; Functions can share a symbol name</h2>
<div class="outline-text-2" id="text-org83fa340">
<p>
Because symbols have separate function and value cells, we can have a
variable and a function with the same name. Common Lisp determines
whether a symbol refers to a function or a variable based on the
context in which it appears.  If a symbol appears as the first element
of a list that is to be evaluated, it is treated as a function
name. In other contexts it is treated as a variable name.
</p>
</div>
</div>

<div id="outline-container-org5a82b5f" class="outline-2">
<h2 id="org5a82b5f">What are Variables?</h2>
<div class="outline-text-2" id="text-org5a82b5f">
<p>
As noted at the start of this guide, variables are a place where a
value is stored. Variables represent references to objects and
assigning a variable a new value changes what object the variable
refers to but has no effect on the previously referenced
object. However, if a variable holds a reference to a mutable object,
you can use that reference to modify the object, and the modification
will be visible to any code that has a reference to the same object.
</p>

<p>
Each time a function is called, Lisp creates new bindings to hold the
arguments passed by the function's caller. A binding is the runtime
manifestation of a variable. A single variable - the thing you can
point to in the program's source code - can have many different
bindings during a run of the program. A single variable can even have
multiple bindings at the same time; parameters to a recursive
function, for example, are rebound for each call to the function.
</p>

<p>
Much of Lisp’s terminology for variables is a holdover from the days
when dynamic scoping was the norm. For historical reasons some writers
talk about ‘‘binding a variable’’ when they mean ‘‘creating a new
variable.’’ But people also say ‘‘unbound variable’’ when they mean
‘‘unassigned variable.’’ Binding does not refer strictly to
assignment; that is one of the major sources of terminological
confusion in Lisp. Non-global lexical variables always have values,
but it is possible for global or special variables to exist without a
value. We won’t get into the arcane details of that here.  21.4
Interplay of Symbols &amp; Variables Variables are named by symbols but
they are not symbols themselves.  Symbols are related to variables in
two very different ways:
</p>

<p>
Special variables (i.e. global variables), such as those established
by DEFVAR and DEFPARAMETER, are stored with a symbol with the same
name. The value of the special variable is stored within the value
cell of the symbol.
</p>

<p>
Lexical variables and lexical function definitions are also named by
symbols, but here the symbol is only an object identifier, and not a
“full symbol”. In this role, only the symbol’s name is significant and
Common Lisp provides no operations on symbols that can have any effect
on a lexical variable or a lexical function definition.                    |                               |
</p>

<ul class="org-ul">
<li>Special Variables (DEFVAR &amp; DEFPARAMETER): Variable are named by the symbol, whose value</li>
</ul>
<p>
cell holds the variables value. A symbol evaluates to the value of the
variable it holds. Any part of the program can access the variable by referencing the
associated symbol that exists within the global Lisp user
package. Hence, the variable is a global variable.
</p>

<ul class="org-ul">
<li>Lexical Variables &amp; Functions (LET, LET*, FLET, LABELS): Variables are named by the symbol, but there is no local symbol that is holding the</li>
</ul>
<p>
variable’s value. By compile time, this reference is translated to
location in memory and there will be no trace of the symbol. Parts of
the program outside of the lexical scope cannot reference the variable
through its symbol name as no symbol is created within the global Lisp
user package.
</p>
</div>
</div>


<div id="outline-container-org9ecfef1" class="outline-2">
<h2 id="org9ecfef1">Symbols &amp; Property Lists (PLIST)</h2>
<div class="outline-text-2" id="text-org9ecfef1">
<p>
Symbols have a component called the property list, or plist. By
convention this is always a list whose even-numbered components
(calling the first component zero) are symbols, here functioning as
property names, and whose odd-numbered components are associated
property values (either a value or a function, but not
both). Functions are provided for manipulating this property list; in
effect, these allow a symbol to be treated as an extensible record
structure.
</p>

<p>
The function GET is used to retrieve a value associated with a key in
a symbol’s property list and we can use it in conjunction with SETF to
set values:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Uses eql to compare keys</span>

(get 'symbol-name 'my-key)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Set my-key to 3</span>

(setf (get 'symbol-name 'my-key) 3)

</pre>
</div>

<p>
To illustrate these concepts, the below example associates a function
with a plist key and then we retrieve and apply the function:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(setf (get 'symbol-name 'my-key)
      (<span style="color: #a020f0;">lambda</span> (x) (+ x 100)))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Returns 101</span>

(funcall (get 'symbol-name 'my-key) 1)

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 24 July 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
